//=============================================================================
//
// モデル処理 [model.h]
// Author : 
//
//=============================================================================
#ifndef _GORL_H_
#define _GORL_H_

#include "main.h"

//*****************************************************************************
// 構造体宣言
//*****************************************************************************


//typedef struct	// バレット構造体
//{
//	D3DXVECTOR3			posPlayer;				// モデルの位置
//	D3DXVECTOR3			rotPlayer;				// モデルの向き(回転)
//	D3DXVECTOR3			sclPlayer;				// モデルの大きさ(スケール)
//
//} PLAYER;




//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitGorl(void);
void UninitGorl(void);
void UpdateGorl(void);
void DrawGorl(void);
D3DXVECTOR3 *GetGorlPos(void);
#endif



#pragma once
